{
    "scrName": [
        {
            "Num": "0", 
            "btnName": "Combine Uv", 
            "descName": "Combina meshes e transfere UVs entre elas sem perder o nome dos objs.\nUso: Para dar o combine, criar um grupo (Ex: Heart.grp) que contenha as meshes (Ex: Vein_1, Vein_2). Selecione o grupo e precione o combine.\nO combine irá gerar uma mesh com sufixo \"_Combined\" (Ex: Heart.grp_Comined)\nPara separar, selecione a mesh combinada gerada pelo combine (Ex: Heart.grp_Comined) e o grupo antigo (Ex: Heart.grp), e dê o separate.", 
            "fName": "UvTransfer_Combine"
        }, 
        {
            "Num": "1", 
            "btnName": "RSPC Tools", 
            "descName": "Ferramenta com 4 micro funções: Renomear: renomeia um objeto substituindo \ncaixa alta por caixa baixa nos caracteres Select: seleciona lista de objetos que estiverem com seus nomes na caixa de texto Print: executa \num print da lista de objetos selecionados Combine: Combina objetos, centraliza pivot e exclui historico", 
            "fName": "selector"
        }, 
        {
            "Num": "2", 
            "btnName": "Compare List", 
            "descName": "Compara 1 grupo com uma lista externa (Ex: excel) em texto e exibe em 2 \njanelas o que cada um tem de diferente do outro. \nUso: Selecionar um grupo e clicar em Selection, colar a lista em texto na caixa List e clicar \nno botão LIST, por fim clicar em Compareulti", 
            "fName": "compareWithList"
        }, 
        {
            "Num": "3", 
            "btnName": "MultiTools", 
            "descName": "Ferramenta com 4 micro funções: \n General Tools: renomeia objetos \nGroup Tools: comparação de grupos \nRigging Tools: Cria controlador com constraint atrelado a uma joint. \nAnimation Tools: ?", 
            "fName": "medToolsDock"
        }, 
        {
            "Num": "4", 
            "btnName": "Mode Switch", 
            "descName": "Altera linkagem de constraints para criação de poses do retarget", 
            "fName": "ModeSwitch"
        }, 
        {
            "Num": "5", 
            "btnName": "Export BS", 
            "descName": "Exporta Blendshapes", 
            "fName": "ExportBS"
        }, 
        {
            "Num": "6", 
            "btnName": "Joint Converter", 
            "descName": "Converte o(s) objeto(s) (placeholder) selecionado(s) para joint, importante, o(s) objeto(s) será(ão) excluído(s). \nUso: Selecionar o objeto e executar o script", 
            "fName": "HolderToJoint"
        }, 
        {
            "Num": "7", 
            "btnName": "Ik/Fk Blend", 
            "descName": "Ik/Fk Blend automatico utilizando BlendColor \n Infos: \n Como esse Script usa apenas um BlendColor, ele também cria apenas UM IkFkBlend. Isso implica que se for necessário separar os IkFkBlends com nomes diferentes em um mesmo controlador, existem duas opções: \n1 - Utilize o outro Script (IkFkBlendParent) \n2 - Mude o nome em niceName e longName nas linhas deste código \n", 
            "fName": "IkFk_BlendColor"
        }, 
        {
            "Num": "8", 
            "btnName": "Object LongName", 
            "descName": "Exibe um Print do long name de um objeto \nUso: Selecionar um objeto e rodar o script", 
            "fName": "LongNameFetch"
        }, 
        {
            "Num": "9", 
            "btnName": "Locator Placer", 
            "descName": "Cria um locator no(s) objeto(s) selecionado sufixo _Loc e o mesmo nome do(s) objeto(s) \nUso: Selecionar objeto(s) e rodar o script", 
            "fName": "PlaceLoc"
        }, 
        {
            "Num": "10", 
            "btnName": "Transform Transfer", 
            "descName": "Transfere posição, escala e rotação aproximada entre objetos similares \ncom topologia diferente (ex. partes do corpo que se movem em reimportação). Importante, essa transferencia nao depende de uv ou \ngeometria, porém usa lattice e bounding box, objetos muito diferentes podem não dar bons resultados. Este Script pode ser usado em conjunto\n com script para combinar e separar mantendo o nome para mover uma região inteira. \nUso: Selecionar o objeto na posição alvo, selecionar o objeto a ser deformado e rodar o script", 
            "fName": "positiontransfer"
        }, 
        {
            "Num": "11", 
            "btnName": "UV Set Transfer", 
            "descName": "Transfere uvs entre diferentes UVsets em um mesmo objeto, é util pois \nfunciona com multiplos objetos selecionados. \nAtualmente script possui nomes dos uvsets definidos no codigo. \nUso: Selecionar o(s) objeto(s) com 2 uvsets e rodar o script.", 
            "fName": "transferuvset"
        }, 
        {
            "Num": "12", 
            "btnName": "Nurb Vertex", 
            "descName": "Cria um objeto temporario no centro da seleção de vertices (nurbs sphere)\nUso: Selecionar pelo menos 4 vertices e executar o script", 
            "fName": "VtxCenter"
        }
    ]
}